In [18]:
import numpy as np
import pandas as pd

In [5]:
# DataFrame 
# info = {
#     "Name" : ["Rahul","Aayush","Pandey"],
#     "CGPA" :[7.5,7.2,9.4]
# }

# df = pd.DataFrame(info)
# df
# print(df)

In [6]:
# #Series
# s = pd.Series([1,2,3,4,5,6])
# # s
# # print(s,type(s))

# # index
# print(s[2])

In [7]:
# s = pd.Series([23,28,32,45],index=["adam","eve","bod","charlie"])
# print(s)

# print(s["eve"])
# # print(s[1])
# # FutureWarning: Series.__getitem__ treating keys as positions is deprecated.
# # In a future version, integer keys will always be treated as labels

In [8]:
# s1 = pd.Series([])

In [9]:
# #CSV Data
# df1 = pd.read_csv("employee_data.csv")

# print(df1,type(df1))

In [10]:
# # Json

# df2 = pd.read_json("employedata.json")
# print(df2)

In [11]:
# df2.head() #Starting 5 rows
# df2.tail() #last 5 rows df2.tail(2) last two or any n rows
# df2.sample() #random row

In [12]:
# df2.info()

In [13]:
# # df2.shape

# df2.describe()

In [14]:
# # Filtering of data

# # df2[ (df2["Salary"] >= 82000) & (df2["Age"]>42) ]
# df2[ (df2["Salary"] >= 82000) | (df2["Age"]>30) ][["Name","ID"]] # Chaining with only required fields

In [21]:
# Creating DataFrom using Numpy array 
np_arr = np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]) 
df = pd.DataFrame(np_arr, columns=["Col1", "Col2", "Col3"]) 
print(df)

   Col1  Col2  Col3
0     1     2     3
1     4     5     6
2     7     8     9

In [22]:
# Creating DataFrom using Lists 
l = [["Adam", 96], ["Eve", 75], ["Bob", 82], ["Charlie", 92]] 
df = pd.DataFrame(l, columns=["Name", "Marks"]) 
print(df)

      Name  Marks
0     Adam     96
1      Eve     75
2      Bob     82
3  Charlie     92

In [35]:
data={'Name':['Aarav','Isha','Rohan','Sneha','Vikram'],
      'Age':[25, 30, 35, 40, 45], 
      'City': ['Delhi', 'Mumbai', 'Bangalore', 'Kolkata', 'Chennai'] }
df = pd.DataFrame(data)
# df.loc[0,"City"]
# df.loc[0]
# df.loc[0:3]

In [31]:
# df.loc[0] # 1st row (by label) 
# df.loc[0:3] # row0 to row3 -both inclusive in loc 
# df.loc[0, "country"] # 0th row & specific colum

     Name  Age       City
0   Aarav   25      Delhi
1    Isha   30     Mumbai
2   Rohan   35  Bangalore
3   Sneha   40    Kolkata
4  Vikram   45    Chennai

In [38]:
df.iloc[0]
df.iloc[0:2] #last index is not included 
#In iloc , when we slice, the ending index is NOT inclusive.

    Name  Age    City
0  Aarav   25   Delhi
1   Isha   30  Mumbai

In [42]:
df.at[0,"City"]
df.iat[0,2]

'Delhi'

In [46]:
df[df['Age']>30]
df[(df['Age']<30)&(df['City']=='Delhi')]

    Name  Age   City
0  Aarav   25  Delhi

In [48]:
df.query("Age >=25 and City=='Delhi' ")

    Name  Age   City
0  Aarav   25  Delhi

In [49]:
#Query StringRules:
# 1.We write the condition in a string.
# 2.We can use operators like and , or ,not , == , != , > , < , <=etc.